---
kind: type
id: T:Autodesk.Revit.DB.PanelTypeSetIterator
source: html/10b9c23c-34bf-d14f-be0d-93d50033262e.htm
---
# Autodesk.Revit.DB.PanelTypeSetIterator

An iterator to a panel type set.

## Syntax (C#)
```csharp
public abstract class PanelTypeSetIterator : APIObject,
	IEnumerator
```